//Если переменная a равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
// let a = 0;
// if(a===0){
//     alert('Верно');
// } else {
//     alert('Неверно');
// }

//Если переменная a больше нуля, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
// let a = 1;
// if(a>0){
//     alert('Верно');
// } else {
//     alert('Неверно');
// }

//Если переменная a меньше нуля, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
// let a = -3;
// if(a<0){
//     alert('Верно');
// } else {
//     alert('Неверно');
// }

//Если переменная a больше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
// let a = 0;
// if(a>=0){
//     alert('Верно');
// } else {
//     alert('Неверно');
// }

//Если переменная a меньше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
// let a = 1;
// if(a<=0){
//     alert('Верно');
// } else {
//     alert('Неверно');
// }

//Если переменная a не равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
// let a = 0;
// if(a!==0){
//     alert('Верно');
// } else {
//     alert('Неверно');
// }

//Если переменная a равна 'test', то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 'test', 'тест', 3.
// let a = 'тест';
// if(a==='test'){
//     alert('Верно');
// } else {
//     alert('Неверно');
// }

//Если переменная a равна '1' и по значению и по типу, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном '1', 1, 3.
// let a = '1';
// if(a===1 && a===Number){
//     alert('Верно')
// } alert('Неверно');

//Если переменная test равна true, то выведите 'Верно', иначе выведите 'Неверно'.
//Проверьте работу скрипта при test, равном true, false. Напишите два варианта скрипта - с короткой записью и с длинной.

// let test = true;

// if (test === true){
//     alert('верно');
// }else{
//     alert('неверно');
// };

// Если переменная test не равна true, то выведите 'Верно', иначе выведите 'Неверно'. 
// Проверьте работу скрипта при test, равном true, false. Напишите два варианта скрипта - с короткой записью и с длинной.

// let test = true;

// if (test !== true){
//     alert('верно');
// }else{
//     alert('неверно');
// };

// Если переменная a больше нуля и меньше 5-ти, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 5, 0, -3, 2.

// let a = 2;

// if (a>0 & a<5){
//     alert('Верно');
// } else {
//     alert('Неверно');
// };

// Если переменная a равна нулю или равна двум, то прибавьте к ней 7, иначе поделите ее на 10. 
// Выведите новое значение переменной на экран. Проверьте работу скрипта при a, равном 5, 0, -3, 2.

// let a = 1;

// if(a===0 || a===2){
//     a += 7;
//     alert(a);
// }else{
//     a /= 10;
//     alert(a);
// };

// Если переменная a равна или меньше 1, а переменная b больше или равна 3, то выведите сумму этих переменных, иначе выведите их разность (результат вычитания). 
// Проверьте работу скрипта при a и b, равном 1 и 3, 0 и 6, 3 и 5.

// let a = 1;
// let b = 3;

// if(a<=1 && b>=3){
//     alert(a+b);
// }else{
//     alert(a-b);
// };

// Если переменная a больше 2-х и меньше 11-ти, или переменная b больше или равна 6-ти и меньше 14-ти, то выведите 'Верно', в противном случае выведите 'Неверно'.

let a = 1;
let b = 5;

if ( a > 2 && a < 11 || b >= 6 && b < 14) {
    alert ('Верно');
}else{
    alert('Неверно');
};

